RegistriesService/test/data/PersonRegistryProfileSOAPRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:PersonRegistryProfileRequest xmlns:m="urn:mil:navy:med:dzreg:types">
			<m:id>647922</m:id>
		</m:PersonRegistryProfileRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>